In [51]:
import pandas as pd
idx1 = ["송중기", "김나현", "권보아", "박효신"]
col1 = ["국어", "영어", "수학"]
val1 = [[82,81,77], [91,95,83], [78,72,88], [82,87,72]]
val2 = [["H", "T", "T"], ["T", "H", "H"], ["H", "H", "H"], ["T", "T", "T"]]
val3 = [list("HTTHHTHHT"), list("HTTHHTHTH"), list("HTTHTHTTT")]
df1 = pd.DataFrame(val1, index=idx1, columns=col1)
df2 = df1.copy()
df3 = pd.DataFrame(val2, index=idx1, columns=["1회", "2회", "3회"])
df4 = pd.DataFrame(val3, index=idx1[:3])
df4.columns = df4.columns + 1
a1 = list("ABCDEFG")
df = df1.copy()
df.loc["이지은"] = [81, 83, 91]
df["성별"] = list("남여여남여")
df["학년"] = list("21112")

In [11]:
df.pivot_table("국어", index="성별", columns="학년", aggfunc='mean')

학년     1     2
성별
남   82.0  82.0
여   84.5  81.0

In [12]:
df1

     국어  영어  수학
송중기  82  81  77
김나현  91  95  83
권보아  78  72  88
박효신  82  87  72

In [14]:
df1.agg("mean", axis = 1)

송중기    80.000000
김나현    89.666667
권보아    79.333333
박효신    80.333333
dtype: float64

In [21]:
pd.concat([df1,df1.apply(["mean", "std", "max", "min"], axis = 1)], axis = 1)

     국어  영어  수학       mean       std   max   min
송중기  82  81  77  80.000000  2.645751  82.0  77.0
김나현  91  95  83  89.666667  6.110101  95.0  83.0
권보아  78  72  88  79.333333  8.082904  88.0  72.0
박효신  82  87  72  80.333333  7.637626  87.0  72.0

## Apply와 agg
### Agg는 group by랑 짝꿍이다.

In [23]:
df1.agg({"국어":["mean", "std"], "영어":["mean", "max"]})

         국어     영어
mean  83.25  83.75
std    5.50    NaN
max     NaN  95.00

In [25]:
df1.agg(lambda x: x.max()- x.min(), axis =1)

송중기     5
김나현    12
권보아    16
박효신    15
dtype: int64

In [28]:
df1.agg(["max", "min", lambda x:x.max() - x.min()], axis = 1)

     max  min  <lambda>
송중기   82   77         5
김나현   95   83        12
권보아   88   72        16
박효신   87   72        15

In [30]:
df3

    1회 2회 3회
송중기  H  T  T
김나현  T  H  H
권보아  H  H  H
박효신  T  T  T

In [35]:
a1

['A', 'B', 'C', 'D', 'E', 'F', 'G']

## Python join
## 문자열의 리스트에서 원소를 하나의 문자열로 이어주는 함수
## 따움표 안의 문자가 각 원소를 연결하는 문자가 된다.

In [36]:
"-".join(a1)

'A-B-C-D-E-F-G'

In [53]:
df4["결과"] = df4.agg(lambda x: "".join(x), axis = 1)
df4

     1  2  3  4  5  6  7  8  9            결과
송중기  H  T  T  H  H  T  H  H  T  HTTHHTHHTHTT
김나현  H  T  T  H  H  T  H  T  H  HTTHHTHTHTHH
권보아  H  T  T  H  T  H  T  T  T  HTTHTHTTTHHH

In [54]:
df4["결과"].str.contains("TTT")

송중기    False
김나현    False
권보아     True
Name: 결과, dtype: bool